<?php

declare(strict_types=1);

use App\Enums\TaskLimit;

$startCommandText = <<<END
👋 Minimalist-ке қош келдіңіз!

Сіздің қарапайым және жеңіл тапсырма менеджеріңіз, дәл осы жерде Telegram-да. Тапсырмаларыңызды оңай басқарыңыз және Minimalist-пен ұйымдасқан болыңыз.

Бастау үшін төмендегі командаларды қолданыңыз:
**/today**: Бүгінгі тапсырмаларды басқару 📅
**/tomorrow**: Ертеңге жоспарлау 🗓️
**/future**: Болашақ күндерге тапсырмаларды ұйымдастыру 📆

🔔 Бүгінгі күннің жоспарын көру үшін /today командасынан бастауды ұсынамыз.

Міне, не істей аласыз:
➕: Қарапайым командамен жаңа тапсырмалар жасау.
🗑️: Қажет емес тапсырмаларды жою.
✅: Тапсырмаларды аяқталған деп белгілеңіз және прогресті бақылаңыз.

Командаларға көмек алу үшін /help теріңіз.

Біз сіздің *жеке деректеріңіздің қауіпсіздігіне* басымдық береміз 🔒. Сондықтан барлық тапсырма атаулары AES (Advanced Encryption Standard) арқылы қауіпсіз шифрланады.

Қарапайым тілмен айтқанда, AES – ең заманауи шифрлау әдістерінің бірі, бұл тапсырмаларыңыздың мәліметтерін бұзып алу мүмкіндігін дерлік жоқ етеді.

Барлығын қарапайым және өнімді ұстайық! 🌟

❤️ мен 🇺🇦 жасаған
END;

$helpCommandText = <<<EOF
Минималист - Telegram-дағы қарапайым және қысқа тапсырмалар менеджері. Жұмысты бастауға арналған пәрмендер тізімі:

Командалар:

/start: Minimalist-пен бастаңыз және ботты қалай пайдалану керектігін үйреніңіз.
/today: Бүгінгі тапсырмаларыңызды басқару 📅
/tomorrow: Ертеңгі тапсырмаларыңызды жоспарлау 🗓️
/future: Болашақ күндерге тапсырмаларды ұйымдастыру 📆

Көбірек көмек керек пе?
Егер сізге қосымша көмек қажет болса немесе сұрақтарыңыз болса, көмек алу үшін бізге хабарласыңыз: @ihorrud.
EOF;

$eveningReminderText = <<<EOF


*Бүгін орындалды: %d*
*Бүгін істеген жоқпын: %d*

/ертең - тапсырмаларды ертеңге жоспарлаңыз.
/болашақ - алдағы күндерге тапсырмаларыңызды реттеңіз.
EOF;


return [
    'commands' => [
        'start' => $startCommandText,
        'help' => $helpCommandText,
        'view' => [
            'header' => "📅 *%s*\n\n",
            'body-no-tasks' => '📝 Әлі тапсырмалар жоқ. Ұйымдасқан болу үшін кейбірін қоса бастаңыз!',
        ],
        'specify-task-to' => [
            'complete' => 'Орындағыңыз келетін тапсырманың атын көрсетіңіз.',
            'move' => 'Ертеңге ауыстырғыңыз келетін тапсырманың атын көрсетіңіз.',
            'copy' => 'Ертеңге көшіру үшін тапсырманың атын көрсетіңіз.',
            'delete' => 'Жою үшін тапсырманың атын көрсетіңіз.',
        ],
        'no-tasks-to' => [
            'complete' => '📅 Орындауға жоспарланған тапсырмалар жоқ.',
            'move' => '📅 Ертеңге ауыстыруға жоспарланған тапсырмалар жоқ.',
            'copy' => '📅 Ертеңге көшіруге жоспарланған тапсырмалар жоқ.',
            'delete' => '📅 Жоюға жоспарланған тапсырмалар жоқ.',
        ],
    ],
    'validation' => [
        'errors' => [
            'invalid' => [
                'title' => [
                    'length' => "||(QID: 2)||\n 🚫 Қате: Тапсырманың атауы 3 пен 100 таңба арасында болуы керек.",
                    'characters' => "||(QID: 6)||\n 🚫 Қате: Тапсырманың атауында астын сызу немесе жұлдызшалар сияқты арнайы таңбалар болмауы керек."
                ],
                'date-format' => "||(QID: 4)||\n 🚫 Қате: Жарамсыз күн форматы. Мысалы, 12 қаңтар үшін 12.01 форматында енгізіңіз.",
                'date-in-past-or-invalid' => "||(QID: 5)||\n 🚫 Қате: Күн жарамсыз немесе өткенде. Жыл ішінде жарамды болашақ күнді енгізіңіз. " . date(
                        'Y'
                    ),
            ],
            'business' => [
                'user-exceeded-daily-limit' => sprintf(
                    '🚫 Кешіріңіз, сіз күн сайынғы %d тапсырмалар лимитінен асып кеттіңіз. Көбірек қосуды қалайсыз ба? Premium-ға жаңартыңыз! /premium',
                    TaskLimit::DefaultUser->value
                ),
            ],
        ],
    ],
    'reminders' => [
        'evening' => $eveningReminderText,
    ],
    'exceptions' => [
        'text' => 'Сұрауыңызда мәтін жоқ, мәтіні жоқ нәрсені жіберген болуыңыз мүмкін.',
    ],
];
