<?php

return <<<END
👋 Добро пожаловать в Minimalist!

Ваш простой и удобный менеджер задач прямо здесь, в Telegram. Управляйте своими задачами легко и оставайтесь организованными с Minimalist.

Чтобы начать, используйте следующие команды:
**/today**: Управление сегодняшними задачами 📅
**/tomorrow**: Планирование задач на завтра 🗓️
**/future**: Организация задач на будущее 📆

🔔 Мы рекомендуем начать с команды /today, чтобы увидеть ваш список дел на сегодня.

Вот что вы можете сделать:
**➕ Добавить задачи**: Создавайте новые задачи с помощью простой команды.
**👀 Просмотр задач**: Смотрите задачи на сегодня, завтра и будущее.
**🗑️ Удалить задачи**: Удаляйте задачи, которые больше не нужны.
**✅ Завершить задачи**: Отмечайте задачи как выполненные и отслеживайте прогресс.

Введите /today, чтобы увидеть ваши задачи на сегодня, или используйте кнопки меню ниже.

Для помощи с командами введите /help.

Давайте делать вещи проще и продуктивнее! 🌟
END;
