<?php

return <<<END
👋 Ласкаво просимо до Minimalist!

Ваш простий і зручний менеджер завдань прямо тут, у Telegram. Керуйте своїми завданнями легко та залишайтеся організованими з Minimalist.

Щоб почати, скористайтеся наступними командами:
**/today**: Керування завданнями на сьогодні 📅
**/tomorrow**: Планування завдань на завтра 🗓️
**/future**: Організація завдань на майбутнє 📆

🔔 Рекомендуємо почати з команди /today, щоб побачити ваші завдання на сьогодні.

Ось що ви можете зробити:
**➕ Додати завдання**: Створюйте нові завдання за допомогою простої команди.
**👀 Перегляд завдань**: Переглядайте завдання на сьогодні, завтра та майбутнє.
**🗑️ Видалити завдання**: Видаляйте завдання, які більше не потрібні.
**✅ Завершити завдання**: Позначайте завдання як виконані та відстежуйте прогрес.

Введіть /today, щоб побачити ваші завдання на сьогодні, або використовуйте кнопки меню нижче.

Для допомоги з командами введіть /help.

Давайте робити речі простішими та продуктивнішими! 🌟
END;
